const E = /^[a-zA-Z0-9._-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/, A = /^1[3-9]\d{9}$/, _ = /^[1-9]\d{5}\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}$/, a = /^[1-9]\d{5}(18|19|20)\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[\dX]$/, R = /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领][A-Z][A-Z0-9]{4}[A-Z0-9挂学警港澳领]$/, f = /^\d{13,19}$/, t = /^[1-9]\d{4,10}$/, F = /^[a-zA-Z][a-zA-Z\d_-]{5,19}$/, G = /^(https?:\/\/)?([\da-z.-]+)\.([a-z.]{2,6})([/\w .-]*)*\/?$/, X = /^(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$/, d = /(([0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,7}:|([0-9a-fA-F]{1,4}:){1,6}:[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,5}(:[0-9a-fA-F]{1,4}){1,2}|([0-9a-fA-F]{1,4}:){1,4}(:[0-9a-fA-F]{1,4}){1,3}|([0-9a-fA-F]{1,4}:){1,3}(:[0-9a-fA-F]{1,4}){1,4}|([0-9a-fA-F]{1,4}:){1,2}(:[0-9a-fA-F]{1,4}){1,5}|[0-9a-fA-F]{1,4}:((:[0-9a-fA-F]{1,4}){1,6})|:((:[0-9a-fA-F]{1,4}){1,7}|:))/, $ = /^[1-9]\d{5}$/, o = /^(E|G|P|S)\d{8}$|^(1[45])\d{7}$|^[GEP]\d{8}$/, s = /^[A-Z0-9]{8}-[A-Z0-9]$/, c = /^[0-9A-HJ-NPQRTUWXY]{2}\d{6}[0-9A-HJ-NPQRTUWXY]{10}$/, n = /^([0-9A-Fa-f]{2}[-:]){5}([0-9A-Fa-f]{2})$|^([0-9A-Fa-f]{4}[.]){2}([0-9A-Fa-f]{4})$/, P = /^0\d{2,3}-?\d{7,8}$/;
export {
  f as BANK_CARD_REGEX,
  c as CREDIT_CODE_REGEX,
  E as EMAIL_REGEX,
  _ as ID_CARD_15_REGEX,
  a as ID_CARD_18_REGEX,
  X as IPV4_REGEX,
  d as IPV6_REGEX,
  R as LICENSE_PLATE_REGEX,
  n as MAC_REGEX,
  s as ORG_CODE_REGEX,
  o as PASSPORT_REGEX,
  A as PHONE_REGEX,
  t as QQ_REGEX,
  P as TEL_REGEX,
  G as URL_REGEX,
  F as WECHAT_REGEX,
  $ as ZIP_CODE_REGEX
};
